test/good/readonly-1.cfg.dot
digraph "readonly-1" {
    node [shape=box];
    subgraph "cluster_test" {
        label="test";
        "test_142" [label="let a: Int = 10"];
        "test_143" [label="return a",style=filled,fillcolor="#66A7DB"];
        "test_142" -> "test_143";
    }
    subgraph "cluster_Test__test" {
        label="Test__test";
        "Test__test_145" [label="let result: Int? = self.m.get(a)"];
        "Test__test_146" [label="if (result == 1)"];
        "Test__test_148" [label="return true",style=filled,fillcolor="#66A7DB"];
        "Test__test_150" [label="return false",style=filled,fillcolor="#66A7DB"];
        "Test__test_145" -> "Test__test_146";
        "Test__test_146" -> "Test__test_148";
        "Test__test_148" -> "Test__test_150";
    }
}
